; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-26-24)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 - object)
(:init
(at-robby robot1 room12)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room19)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room22)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room24)
(at ball2 room3)
(at ball3 room26)
(at ball4 room22)
(at ball5 room23)
(at ball6 room5)
(at ball7 room20)
(at ball8 room7)
(at ball9 room12)
(at ball10 room26)
(at ball11 room21)
(at ball12 room24)
(at ball13 room2)
(at ball14 room6)
(at ball15 room7)
(at ball16 room25)
(at ball17 room8)
(at ball18 room1)
(at ball19 room12)
(at ball20 room8)
(at ball21 room18)
(at ball22 room18)
(at ball23 room1)
(at ball24 room5)
)
(:goal
(and
(at ball1 room6)
(at ball2 room2)
(at ball3 room16)
(at ball4 room10)
(at ball5 room14)
(at ball6 room9)
(at ball7 room6)
(at ball8 room11)
(at ball9 room12)
(at ball10 room5)
(at ball11 room7)
(at ball12 room8)
(at ball13 room10)
(at ball14 room26)
(at ball15 room14)
(at ball16 room22)
(at ball17 room26)
(at ball18 room9)
(at ball19 room19)
(at ball20 room1)
(at ball21 room14)
(at ball22 room26)
(at ball23 room25)
(at ball24 room21)
)
)
)

; plan
1. (pick robot3 ball4 room22 lgripper3)
   deleted: (at ball4 room22) (free robot3 lgripper3)
   added: (carry robot3 ball4 lgripper3)
   goals met: 1 of 24
2. (pick robot1 ball19 room12 lgripper1)
   deleted: (at ball19 room12) (free robot1 lgripper1)
   added: (carry robot1 ball19 lgripper1)
   goals met: 1 of 24
3. (move robot2 room19 room9)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room9)
   goals met: 1 of 24
4. (move robot1 room12 room19)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room19)
   goals met: 1 of 24
5. (move robot3 room22 room2)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room2)
   goals met: 1 of 24
6. (move robot2 room9 room3)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room3)
   goals met: 1 of 24
7. (drop robot1 ball19 room19 lgripper1)
   deleted: (carry robot1 ball19 lgripper1)
   added: (at ball19 room19) (free robot1 lgripper1)
   goals met: 2 of 24
8. (pick robot3 ball13 room2 rgripper3)
   deleted: (at ball13 room2) (free robot3 rgripper3)
   added: (carry robot3 ball13 rgripper3)
   goals met: 2 of 24
9. (pick robot2 ball2 room3 lgripper2)
   deleted: (at ball2 room3) (free robot2 lgripper2)
   added: (carry robot2 ball2 lgripper2)
   goals met: 2 of 24
10. (move robot3 room2 room10)
   deleted: (at-robby robot3 room2)
   added: (at-robby robot3 room10)
   goals met: 2 of 24
11. (move robot2 room3 room2)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room2)
   goals met: 2 of 24
12. (move robot1 room19 room1)
   deleted: (at-robby robot1 room19)
   added: (at-robby robot1 room1)
   goals met: 2 of 24
13. (drop robot3 ball4 room10 lgripper3)
   deleted: (carry robot3 ball4 lgripper3)
   added: (at ball4 room10) (free robot3 lgripper3)
   goals met: 3 of 24
14. (drop robot3 ball13 room10 rgripper3)
   deleted: (carry robot3 ball13 rgripper3)
   added: (at ball13 room10) (free robot3 rgripper3)
   goals met: 4 of 24
15. (drop robot2 ball2 room2 lgripper2)
   deleted: (carry robot2 ball2 lgripper2)
   added: (at ball2 room2) (free robot2 lgripper2)
   goals met: 5 of 24
16. (pick robot1 ball23 room1 lgripper1)
   deleted: (at ball23 room1) (free robot1 lgripper1)
   added: (carry robot1 ball23 lgripper1)
   goals met: 5 of 24
17. (move robot1 room1 room25)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room25)
   goals met: 5 of 24
18. (move robot3 room10 room9)
   deleted: (at-robby robot3 room10)
   added: (at-robby robot3 room9)
   goals met: 5 of 24
19. (move robot2 room2 room24)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room24)
   goals met: 5 of 24
20. (drop robot1 ball23 room25 lgripper1)
   deleted: (carry robot1 ball23 lgripper1)
   added: (at ball23 room25) (free robot1 lgripper1)
   goals met: 6 of 24
21. (pick robot1 ball16 room25 rgripper1)
   deleted: (at ball16 room25) (free robot1 rgripper1)
   added: (carry robot1 ball16 rgripper1)
   goals met: 6 of 24
22. (pick robot2 ball12 room24 lgripper2)
   deleted: (at ball12 room24) (free robot2 lgripper2)
   added: (carry robot2 ball12 lgripper2)
   goals met: 6 of 24
23. (pick robot2 ball1 room24 rgripper2)
   deleted: (at ball1 room24) (free robot2 rgripper2)
   added: (carry robot2 ball1 rgripper2)
   goals met: 6 of 24
24. (move robot3 room9 room8)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room8)
   goals met: 6 of 24
25. (move robot1 room25 room22)
   deleted: (at-robby robot1 room25)
   added: (at-robby robot1 room22)
   goals met: 6 of 24
26. (move robot2 room24 room8)
   deleted: (at-robby robot2 room24)
   added: (at-robby robot2 room8)
   goals met: 6 of 24
27. (pick robot3 ball20 room8 lgripper3)
   deleted: (at ball20 room8) (free robot3 lgripper3)
   added: (carry robot3 ball20 lgripper3)
   goals met: 6 of 24
28. (pick robot3 ball17 room8 rgripper3)
   deleted: (at ball17 room8) (free robot3 rgripper3)
   added: (carry robot3 ball17 rgripper3)
   goals met: 6 of 24
29. (drop robot1 ball16 room22 rgripper1)
   deleted: (carry robot1 ball16 rgripper1)
   added: (at ball16 room22) (free robot1 rgripper1)
   goals met: 7 of 24
30. (drop robot2 ball12 room8 lgripper2)
   deleted: (carry robot2 ball12 lgripper2)
   added: (at ball12 room8) (free robot2 lgripper2)
   goals met: 8 of 24
31. (move robot3 room8 room26)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room26)
   goals met: 8 of 24
32. (move robot2 room8 room6)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room6)
   goals met: 8 of 24
33. (move robot1 room22 room20)
   deleted: (at-robby robot1 room22)
   added: (at-robby robot1 room20)
   goals met: 8 of 24
34. (drop robot3 ball17 room26 rgripper3)
   deleted: (carry robot3 ball17 rgripper3)
   added: (at ball17 room26) (free robot3 rgripper3)
   goals met: 9 of 24
35. (drop robot2 ball1 room6 rgripper2)
   deleted: (carry robot2 ball1 rgripper2)
   added: (at ball1 room6) (free robot2 rgripper2)
   goals met: 10 of 24
36. (pick robot2 ball14 room6 lgripper2)
   deleted: (at ball14 room6) (free robot2 lgripper2)
   added: (carry robot2 ball14 lgripper2)
   goals met: 10 of 24
37. (pick robot1 ball7 room20 lgripper1)
   deleted: (at ball7 room20) (free robot1 lgripper1)
   added: (carry robot1 ball7 lgripper1)
   goals met: 10 of 24
38. (move robot3 room26 room9)
   deleted: (at-robby robot3 room26)
   added: (at-robby robot3 room9)
   goals met: 10 of 24
39. (move robot1 room20 room6)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room6)
   goals met: 10 of 24
40. (move robot2 room6 room26)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room26)
   goals met: 10 of 24
41. (move robot3 room9 room1)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room1)
   goals met: 10 of 24
42. (drop robot1 ball7 room6 lgripper1)
   deleted: (carry robot1 ball7 lgripper1)
   added: (at ball7 room6) (free robot1 lgripper1)
   goals met: 11 of 24
43. (drop robot2 ball14 room26 lgripper2)
   deleted: (carry robot2 ball14 lgripper2)
   added: (at ball14 room26) (free robot2 lgripper2)
   goals met: 12 of 24
44. (pick robot2 ball3 room26 rgripper2)
   deleted: (at ball3 room26) (free robot2 rgripper2)
   added: (carry robot2 ball3 rgripper2)
   goals met: 12 of 24
45. (drop robot3 ball20 room1 lgripper3)
   deleted: (carry robot3 ball20 lgripper3)
   added: (at ball20 room1) (free robot3 lgripper3)
   goals met: 13 of 24
46. (pick robot3 ball18 room1 rgripper3)
   deleted: (at ball18 room1) (free robot3 rgripper3)
   added: (carry robot3 ball18 rgripper3)
   goals met: 13 of 24
47. (move robot2 room26 room16)
   deleted: (at-robby robot2 room26)
   added: (at-robby robot2 room16)
   goals met: 13 of 24
48. (move robot3 room1 room9)
   deleted: (at-robby robot3 room1)
   added: (at-robby robot3 room9)
   goals met: 13 of 24
49. (move robot1 room6 room14)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room14)
   goals met: 13 of 24
50. (move robot1 room14 room7)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room7)
   goals met: 13 of 24
51. (drop robot2 ball3 room16 rgripper2)
   deleted: (carry robot2 ball3 rgripper2)
   added: (at ball3 room16) (free robot2 rgripper2)
   goals met: 14 of 24
52. (drop robot3 ball18 room9 rgripper3)
   deleted: (carry robot3 ball18 rgripper3)
   added: (at ball18 room9) (free robot3 rgripper3)
   goals met: 15 of 24
53. (pick robot1 ball8 room7 lgripper1)
   deleted: (at ball8 room7) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 15 of 24
54. (move robot2 room16 room9)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room9)
   goals met: 15 of 24
55. (move robot3 room9 room7)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room7)
   goals met: 15 of 24
56. (move robot1 room7 room11)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room11)
   goals met: 15 of 24
57. (pick robot3 ball15 room7 lgripper3)
   deleted: (at ball15 room7) (free robot3 lgripper3)
   added: (carry robot3 ball15 lgripper3)
   goals met: 15 of 24
58. (move robot2 room9 room5)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room5)
   goals met: 15 of 24
59. (drop robot1 ball8 room11 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room11) (free robot1 lgripper1)
   goals met: 16 of 24
60. (move robot3 room7 room14)
   deleted: (at-robby robot3 room7)
   added: (at-robby robot3 room14)
   goals met: 16 of 24
61. (pick robot2 ball6 room5 lgripper2)
   deleted: (at ball6 room5) (free robot2 lgripper2)
   added: (carry robot2 ball6 lgripper2)
   goals met: 16 of 24
62. (drop robot3 ball15 room14 lgripper3)
   deleted: (carry robot3 ball15 lgripper3)
   added: (at ball15 room14) (free robot3 lgripper3)
   goals met: 17 of 24
63. (move robot2 room5 room9)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room9)
   goals met: 17 of 24
64. (move robot1 room11 room7)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room7)
   goals met: 17 of 24
65. (drop robot2 ball6 room9 lgripper2)
   deleted: (carry robot2 ball6 lgripper2)
   added: (at ball6 room9) (free robot2 lgripper2)
   goals met: 18 of 24
66. (move robot3 room14 room23)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room23)
   goals met: 18 of 24
67. (move robot1 room7 room5)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room5)
   goals met: 18 of 24
68. (pick robot3 ball5 room23 lgripper3)
   deleted: (at ball5 room23) (free robot3 lgripper3)
   added: (carry robot3 ball5 lgripper3)
   goals met: 18 of 24
69. (move robot2 room9 room7)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room7)
   goals met: 18 of 24
70. (pick robot1 ball24 room5 lgripper1)
   deleted: (at ball24 room5) (free robot1 lgripper1)
   added: (carry robot1 ball24 lgripper1)
   goals met: 18 of 24
71. (move robot3 room23 room14)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room14)
   goals met: 18 of 24
72. (move robot1 room5 room21)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room21)
   goals met: 18 of 24
73. (move robot2 room7 room5)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room5)
   goals met: 18 of 24
74. (drop robot3 ball5 room14 lgripper3)
   deleted: (carry robot3 ball5 lgripper3)
   added: (at ball5 room14) (free robot3 lgripper3)
   goals met: 19 of 24
75. (drop robot1 ball24 room21 lgripper1)
   deleted: (carry robot1 ball24 lgripper1)
   added: (at ball24 room21) (free robot1 lgripper1)
   goals met: 20 of 24
76. (pick robot1 ball11 room21 rgripper1)
   deleted: (at ball11 room21) (free robot1 rgripper1)
   added: (carry robot1 ball11 rgripper1)
   goals met: 20 of 24
77. (move robot2 room5 room26)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room26)
   goals met: 20 of 24
78. (move robot1 room21 room7)
   deleted: (at-robby robot1 room21)
   added: (at-robby robot1 room7)
   goals met: 20 of 24
79. (move robot3 room14 room5)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room5)
   goals met: 20 of 24
80. (pick robot2 ball10 room26 lgripper2)
   deleted: (at ball10 room26) (free robot2 lgripper2)
   added: (carry robot2 ball10 lgripper2)
   goals met: 20 of 24
81. (drop robot1 ball11 room7 rgripper1)
   deleted: (carry robot1 ball11 rgripper1)
   added: (at ball11 room7) (free robot1 rgripper1)
   goals met: 21 of 24
82. (move robot2 room26 room5)
   deleted: (at-robby robot2 room26)
   added: (at-robby robot2 room5)
   goals met: 21 of 24
83. (move robot3 room5 room18)
   deleted: (at-robby robot3 room5)
   added: (at-robby robot3 room18)
   goals met: 21 of 24
84. (drop robot2 ball10 room5 lgripper2)
   deleted: (carry robot2 ball10 lgripper2)
   added: (at ball10 room5) (free robot2 lgripper2)
   goals met: 22 of 24
85. (pick robot3 ball22 room18 lgripper3)
   deleted: (at ball22 room18) (free robot3 lgripper3)
   added: (carry robot3 ball22 lgripper3)
   goals met: 22 of 24
86. (pick robot3 ball21 room18 rgripper3)
   deleted: (at ball21 room18) (free robot3 rgripper3)
   added: (carry robot3 ball21 rgripper3)
   goals met: 22 of 24
87. (move robot3 room18 room26)
   deleted: (at-robby robot3 room18)
   added: (at-robby robot3 room26)
   goals met: 22 of 24
88. (drop robot3 ball22 room26 lgripper3)
   deleted: (carry robot3 ball22 lgripper3)
   added: (at ball22 room26) (free robot3 lgripper3)
   goals met: 23 of 24
89. (move robot3 room26 room14)
   deleted: (at-robby robot3 room26)
   added: (at-robby robot3 room14)
   goals met: 23 of 24
90. (drop robot3 ball21 room14 rgripper3)
   deleted: (carry robot3 ball21 rgripper3)
   added: (at ball21 room14) (free robot3 rgripper3)
   goals met: 24 of 24
